app/controllers/webhooks/argyle/events_controller.rb

  def create
    # signature = OpenSSL::HMAC.hexdigest("SHA512", ENV["ARGYLE_WEBHOOK_SECRET"], request.raw_post)
    #
    # unless request.headers["X-Argyle-Signature"] == signature
    #   return render json: { error: "Invalid signature" }, status: :unauthorized
    # end

    if params["event"] == "paystubs.fully_synced" || params["event"] == "paystubs.partially_synced"
      @cbv_flow = CbvFlow.find_by_argyle_user_id(params["data"]["user"])

      if @cbv_flow
        @cbv_flow.update(payroll_data_available_from: params["data"]["available_from"])
        ArgylePaystubsChannel.broadcast_to(@cbv_flow, params)
      end
    end

    if params["event"] == "accounts.connected"
      rep = ConnectedArgyleAccount.create!(
        user_id: params["data"]["user"],
        account_id: params["data"]["account"]
      )
---
INSERT INTO "connected_argyle_accounts" ("user_id", "account_id", "created_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", "018f110a-39c1-3a5f-826f-a004eb7ed0b5"], ["account_id", "018f3fb4-986d-3963-04ee-f622c4f56c50"], ["created_at", "2024-05-03 18:26:04.664391"]]