app/controllers/cbv_flows_controller.rb

SELECT "cbv_flows".* FROM "cbv_flows" WHERE "cbv_flows"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "cbv_flows" ("case_number", "argyle_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["case_number", "ABC1234"], ["argyle_user_id", nil], ["created_at", "2024-05-01 17:36:50.732857"], ["updated_at", "2024-05-01 17:36:50.732857"]]
---
  def set_cbv_flow
    if session[:cbv_flow_id]
      @cbv_flow = CbvFlow.find(session[:cbv_flow_id])
    else
      # TODO: This case_number would be provided by the case worker when they send the initial invite
      @cbv_flow = CbvFlow.create(case_number: 'ABC1234')

UPDATE "cbv_flows" SET "argyle_user_id" = $1, "updated_at" = $2 WHERE "cbv_flows"."id" = $3  [["argyle_user_id", "018f353b-0819-fc6f-3217-eb5bf2ee4d98"], ["updated_at", "2024-05-01 17:36:52.360087"], ["id", 10]]
---
  def fetch_and_store_argyle_token
    return session[:argyle_user_token] if session[:argyle_user_token].present?

    raise "ARGYLE_API_TOKEN environment variable is blank. Make sure you have the .env.local.local from 1Password." if Rails.application.credentials.argyle[:api_key].blank?

    res = Net::HTTP.post(URI.parse(USER_TOKEN_ENDPOINT), "", {"Authorization" => "Basic #{Rails.application.credentials.argyle[:api_key]}"})
    parsed = JSON.parse(res.body)
    raise "Argyle API error: #{parsed['detail']}" if res.code.to_i >= 400

    @cbv_flow.update(argyle_user_id: parsed['id'])